<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"
	xmlns:content="http://purl.org/rss/1.0/modules/content/"
	xmlns:wfw="http://wellformedweb.org/CommentAPI/"
	xmlns:dc="http://purl.org/dc/elements/1.1/"
	xmlns:atom="http://www.w3.org/2005/Atom"
	xmlns:sy="http://purl.org/rss/1.0/modules/syndication/"
	xmlns:slash="http://purl.org/rss/1.0/modules/slash/"
	xmlns:series="https://publishpress.com/"
	>

<channel>
	<title>Das Tao der Programmierung Archive - Tricktresor</title>
	<atom:link href="/blog/series/das-tao-der-programmierung/feed/" rel="self" type="application/rss+xml" />
	<link>/blog/series/das-tao-der-programmierung/</link>
	<description>Tipps und Tricks zu SAP R/3</description>
	<lastBuildDate>Wed, 04 Dec 2013 18:23:23 +0000</lastBuildDate>
	<language>de-DE</language>
	<sy:updatePeriod>
	hourly	</sy:updatePeriod>
	<sy:updateFrequency>
	1	</sy:updateFrequency>
	<generator>https://wordpress.org/?v=6.4.3</generator>

<image>
	<url>/wp-content/uploads/2019/02/cropped-Tricktresor-favicon-2019-32x32.png</url>
	<title>Das Tao der Programmierung Archive - Tricktresor</title>
	<link>/blog/series/das-tao-der-programmierung/</link>
	<width>32</width>
	<height>32</height>
</image> 
	<item>
		<title>Buch Zwei &#8211; Die alten Meister</title>
		<link>/blog/buch-zwei-die-alten-meister/</link>
					<comments>/blog/buch-zwei-die-alten-meister/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:25:23 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=219</guid>

					<description><![CDATA[<p>Buch Zwei - Die alten Meister</p>
<p>Der Beitrag <a href="/blog/buch-zwei-die-alten-meister/">Buch Zwei &#8211; Die alten Meister</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Zwei &#8211; Die alten Meister<br /><P class="text1" align="left">So also sprach der Meisterprogrammierer:<BR>&bdquo;Nach drei Tagen ohne Programmierung wird das Leben sinnlos.&rdquo;</P><P class="head2">2.1</P><P>Die Programmierer von einst waren mysteri&ouml;s und allwissend. Wir k&ouml;nnen ihre Gedanken nicht nachvollziehen. Das einzige was wir tun k&ouml;nnen, ist ihr Erscheinen zu beschreiben. Aufmerksam wie ein Fuchs der auf der Lauer liegt. Wachsam wie ein General auf dem Schlachtfeld. Freundlich wie eine Hostess, die ihre G&auml;ste begr&uuml;&szlig;t. Einfach wie unbehandeltes Holz. Geheimnisvoll wie das Schimmern schwarzer Pf&uuml;tzen in einer dunklen H&ouml;hle.</P><P>Wer wei&szlig; schon, welche Geheimnisse ihre Herzen und Gedanken verbergen? Die Antwort existiert nur im Tao.</P><P class="head2">2.2</P><P>Gro&szlig;meister Turing tr&auml;umte einst, er w&auml;re eine Maschine. Als er erwachte rief er aus: &bdquo;Ich wei&szlig; nicht, ob ich Turing bin und tr&auml;ume, da&szlig; ich eine Maschine bin, oder eine Maschine, die tr&auml;umt, da&szlig; ich Turing bin!&rdquo;</P><P class="head2">2.3</P><P>Ein Programmierer von einer sehr gro&szlig;en Computerfirma ging zu einer Softwarekonferenz und kehrte zur&uuml;ck, um seinem Chef Bericht zu erstatten.</P><P>Er sagte: &bdquo;Was f&uuml;r eine Art Programmierer arbeitet f&uuml;r die anderen Firmen? Sie benahmen sich schlecht und scherten sich nicht um ihr Aussehen. Ihr Haar war lang und ungepflegt und ihre Sachen waren alt und zerknittert. Sie nutzten die Gastfreundschaft aus und r&uuml;mpften die Nase w&auml;hrend meiner Pr&auml;sentation.&rdquo;</P><P>Der Manager sagte: &bdquo;Ich h&auml;tte Sie nie zu dieser Konferenz schicken sollen. Diese Programmierer leben jenseits der realen Welt. F&uuml;r sie ist das Leben absurd, ein Mi&szlig;geschick des Zufalls. Sie kommen und gehen ohne die Grenzen zu kennen. Sie leben nur f&uuml;r ihre Programme und sorgen sich um nichts anderes. Warum sollten sie sich um soziale Vereinbarungen k&uuml;mmern? Sie leben im Tao.&rdquo;</P><P class="head2">2.4</P><P>Ein Sch&uuml;ler fragte den Meister: &bdquo;Es gibt einen Programmierer, der seine Programme nie plant, dokumentiert oder testet. Doch alle, die ihn kennen sagen, er sei einer der besten Programmierer der Welt. Wie kann das sein?&rdquo;</P><P>Der Meister antwortete: &bdquo;Dieser Programmierer hat das Tao gemeistert. Er ist dar&uuml;ber hinweg seine Programme planen zu m&uuml;ssen; er wird nicht b&ouml;se wenn das System zusammenbricht sondern akzeptiert das Universum ohne es zu hinterfragen. </P><P>Er ist dar&uuml;ber hinweg seine Programme dokumentieren zu m&uuml;ssen; es ist ihm nun egal ob jemand seine Zeilen sieht. Er ist dar&uuml;ber hinweg, seine Programme testen zu m&uuml;ssen; jedes seiner Programme ist in sich perfekt vollendet und elegant, ihr Sinn offensichtlich. </P><P>Wahrlich er hat das Mysterium des Tao erschlossen.&rdquo;</P></p>
<p>Der Beitrag <a href="/blog/buch-zwei-die-alten-meister/">Buch Zwei &#8211; Die alten Meister</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-zwei-die-alten-meister/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Drei &#8211; Entwicklung</title>
		<link>/blog/buch-drei-entwicklung/</link>
					<comments>/blog/buch-drei-entwicklung/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:24:55 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=218</guid>

					<description><![CDATA[<p>Buch Drei - Entwicklung</p>
<p>Der Beitrag <a href="/blog/buch-drei-entwicklung/">Buch Drei &#8211; Entwicklung</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Drei &#8211; Entwicklung<br /><P class="text1" align="left">So also sprach der Meisterprogrammierer:<BR>&bdquo;Hat der Testlauf erst einmal begonnen, so ist es zu sp&auml;t, um &Auml;nderungen am Programm vorzunehmen.&rdquo;</P><P class="head2">3.1</P><P>Es gab einmal einen Mann, der zu einer Computermesse ging. Jeden Tag sagte er der Wache an der T&uuml;r beim Eintreten: &bdquo;Ich bin ein ber&uuml;hmter Gauner, weitbekannt f&uuml;r meine F&auml;higkeit als Ladendieb. Sei gewarnt, auch auf dieser Messe wird gestohlen werden.&rdquo;</P><P>Dieses Gerede beunruhigte den Wachmann sehr, da es drinnen Computerausr&uuml;stungen im Werte von mehreren Millionen Dollar gab. Also beobachtete der Wachposten den Mann sorgf&auml;ltig. Aber der Mann schlenderte lediglich von Stand zu Stand und summte leise vor sich hin. Als der Mann die Messe verlie&szlig;, nahm der Wachposten ihn beiseite und durchsuchte seine Sachen. </P><P>Aber er fand nichts. </P><P>Am n&auml;chsten Messetag kam der Mann wieder und r&uuml;gte den Wachposten mit folgenden Worten: &bdquo;Gestern ging ich mit einer riesigen Beute hinaus, aber heute wird es noch besser laufen.&rdquo;</P><P>Also beobachtete der Wachposten ihn noch sorgf&auml;ltiger, doch ohne Erfolg. Am letzten Tag der Messe konnte der Wachposten seine Neugier nicht l&auml;nger zur&uuml;ckhalten. &bdquo;Herr Dieb&rdquo; fragte er, &bdquo;ich bin so ratlos, da&szlig; ich nicht mehr ruhig schlafen kann. Bitte kl&auml;r mich auf. Was stiehlst du blo&szlig;?&rdquo; </P><P>Der Mann l&auml;chelte: &bdquo;Ich stehle Ideen.&rdquo;</P><P class="head2">3.2 </P><P>Es gab mal einen Meisterprogrammierer, der schrieb unstrukturierte Programme. Ein Neuling, der versuchte ihn nachzuahmen, begann ebenfalls unstrukturiert zu programmieren. Als der Neuling den Meister bat, seinen Fortschritt zu beurteilen, da kritisierte ihn der Meister, weil er unstrukturierte Programme schrieb. Er sagte: &bdquo;Was sich f&uuml;r den Meister schickt, ist noch lange nicht gut f&uuml;r seinen Sch&uuml;ler. Bevor du die Struktur mi&szlig;achtest, mu&szlig;t du das Tao begriffen haben.&rdquo;</P><P class="head2">3.3 </P><P>Es gab einmal einen Programmierer, der dem Hofe des Kriegsherrn Wu angeh&ouml;rte. Der Kriegsherr fragte den Programmierer: &bdquo;Was ist einfacher zu realisieren: ein Anwendungsprogramm oder ein Betriebssystem?&rdquo; </P><P>&bdquo;Ein Betriebssystem,&rdquo; erwiderte der Programmierer. Der Kriegsherr stie&szlig; einen Ruf der Verwunderung aus. &bdquo;Sicherlich ist ein Anwendungsprogramm sehr einfach im Gegensatz zur Komplexit&auml;t eines Betriebssystems,&rdquo; sagte er.</P><P>&bdquo;Dem ist nicht so,&rdquo; sagte der Programmierer. &bdquo;Beim Entwickeln eines Anwendungsprogramms fungiert der Programmierer als Mittler zwischen Leuten verschiedener Ansichten: Wie es ablaufen mu&szlig;, wie die Ausgaben auszusehen haben und wie es zu den Steuergesetzen passen mu&szlig;. Im Gegensatz dazu ist ein Betriebssystem frei von &auml;u&szlig;eren Einfl&uuml;ssen. Beim Entwickeln eines Betriebssystems bem&uuml;ht sich der Programmierer um gr&ouml;&szlig;tm&ouml;gliche Harmonie zwischen Maschine und Ideen. Deswegen ist es einfacher ein Betriebssystem zu entwickeln.&rdquo; </P><P>Der Kriegsherr Wu nickte und l&auml;chelte, &bdquo;Das ist alles sch&ouml;n und gut, aber was ist einfacher zu debuggen?&rdquo; </P><P>Der Programmierer gab keine Antwort.&nbsp; </P><P class="head2">3.4</P><P>Ein Manager ging zu einem Meisterprogrammierer und zeigte ihm die Anforderungen f&uuml;r eine neue Anwendung. Der Manager fragte den Meister: &bdquo;Wie lange wird es dauern, dieses System zu entwickeln, wenn ich f&uuml;nf Programmierer darauf ansetze?&rdquo;</P><P>&bdquo;Es wird ein Jahr dauern,&rdquo; sagte der Meister prompt. </P><P>&bdquo;Aber wir brauchen dieses System sofort, wenn nicht sogar noch fr&uuml;her! Wie lang wird es dauern, wenn ich zehn Programmierer darauf ansetze?&rdquo;</P><P>Der Meister runzelte die Stirn. &bdquo;In diesem Fall wird es zwei Jahre dauern.&rdquo;</P><P>&bdquo;Und wenn ich hundert Programmierer darauf ansetze?&rdquo; </P><P>Der Meister zuckte zusammen. &bdquo;Dann wird es niemals fertig.&rdquo; </P></p>
<p>Der Beitrag <a href="/blog/buch-drei-entwicklung/">Buch Drei &#8211; Entwicklung</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-drei-entwicklung/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Vier &#8211; Codierung</title>
		<link>/blog/buch-vier-codierung/</link>
					<comments>/blog/buch-vier-codierung/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:24:30 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=217</guid>

					<description><![CDATA[<p>Buch Vier - Codierung</p>
<p>Der Beitrag <a href="/blog/buch-vier-codierung/">Buch Vier &#8211; Codierung</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Vier &#8211; Codierung<br /><P>So also sprach der Meisterprogrammierer: <BR>&bdquo;Ein gut geschriebenes Programm ist der Himmel auf Erden; ein schlecht geschriebenes Programm ist die H&ouml;lle.&rdquo;</P><P class="head2">4.1 </P><P>Ein Programm sollte leicht und beweglich sein, seine Unterroutinen verbunden wie die Perlen einer Kette. Der Geist und Absicht des Programms sollten durchgehend beibehalten werden. Es sollte weder zu wenig noch zu viel vorhanden sein, weder unnn&ouml;tige Schleifen noch unn&ouml;tige Variablen verwendet werden, weder Struktureinbu&szlig;en noch &uuml;bertriebene Komplexit&auml;t hingenommen werden. </P><P>Ein Programm sollte dem &#8216;Gesetz der kleinsten &Uuml;berraschung&#8217; folgen. Was bedeutet dieses Gesetz? Es hei&szlig;t einfach, da&szlig; das Programm dem Benutzer immer das antworten sollte, was ihn am wenigsten &uuml;berrascht. Ein Programm, egal wie komplex es ist, sollte als eine Einheit arbeiten. Das Programm sollte mehr von der inneren Logik geleitet werden und weniger vom &auml;u&szlig;eren Erscheinungsbild. </P><P>Wenn das Programm diese Voraussetzungen nicht hat, wird es sich in einem Zustand von Unordnung und Verwirrung befinden. Der einzige Weg um dieses Problem zu beheben ist, es neu zu schreiben.&nbsp; </P><P class="head2">4.2</P><P>Ein Neuling fragte den Meister: &bdquo;Ich habe ein Programm, das manchmal l&auml;uft und manchmal abbricht. Ich habe die Regeln des Programmierens befolgt, nun bin ich v&ouml;llig ratlos. Was ist der Grund daf&uuml;r?&rdquo;</P><P>Der Meister antwortete: &bdquo;Du bist verwirrt, weil du das Tao nicht verstehst. Nur ein Dummkopf erwartet von seinem menschlichen Kollegen rationales Handeln. Warum erwartest du es von einer Maschine, die Menschen gebaut haben? Computer simulieren die Bestimmung; nur das Tao ist perfekt. Die Regeln der Programmierung sind verg&auml;nglich; nur das Tao ist ewig. Deswegen mu&szlig;t du das Tao sorgf&auml;ltig &uuml;berdenken bevor du Erleuchtung findest.&rdquo;</P><P>&bdquo;Aber wie werde ich merken, da&szlig; ich Erleuchtung gefunden habe?&rdquo; fragte der Neuling.</P><P>&bdquo;Dein Programm wird dann fehlerfrei laufen,&rdquo; antwortete der Meister. </P><P class="head2">4.3 </P><P>Ein Meister Erkl&auml;rte die Natur des Tao einem seiner Sch&uuml;ler. </P><P>&bdquo;Das Tao ist in jeder Software enthalten, egal wie wertlos, &bdquo;sagte der Meister. </P><P>&bdquo;Ist das Tao in einem Taschenrechner?&rdquo; fragte der Sch&uuml;ler. </P><P>&bdquo;Es ist,&rdquo; kam die Antwort. </P><P>&bdquo;Ist das Tao in einem Videospiel?&rdquo; fuhr der Sch&uuml;ler fort. </P><P>&bdquo;Selbst in einem Videospiel ist das Tao enthalten,&rdquo; antwortete der Meister. </P><P>&bdquo;Und ist das Tao im DOS f&uuml;r einen Personal Computer?&rdquo;</P><P>Der Meister hustete verlegen und rutschte leicht auf dem Stuhl hin und her. &bdquo;Die Stunde ist f&uuml;r heute beendet,&rdquo; sagte er schlie&szlig;lich.</P><P class="head2"><BR>4.4</P><P>Prinz Wang&#8217;s Programmierer schrieb neue Software. Seine Finger tanzten &uuml;ber die Tastatur. Das Programm &uuml;bersetzte er ohne Fehler und das Programm lief wie ein leichter Wind.</P><P>&bdquo;Exzellent!&rdquo; rief der Prinz, &bdquo;ihre Technik ist fehlerlos!&rdquo;</P><P>&bdquo;Technik?&rdquo; fragte der Programmierer und drehte sich von seinem Computer weg.<BR>&bdquo;Was ich befolge, ist das Tao, jenseits jeder Technik! Als ich das erste mal programmierte sah ich das gesamte Problem in einer Masse. Nach drei Jahren habe ich diese Masse nicht mehr gesehen. Stattdessen benutzte ich Unterprogramme. Aber nun sehe ich nichts. Mein gesamtes Dasein existiert in einer formlosen Leere. Meine Sinne sind im Leerlauf. Mein Geist, frei um ohne Planung zu arbeiten, folgt seinem Instinkt. </P><P>In K&uuml;rze wird sich mein Programm von selbst schreiben. Sicherlich, manchmal gibt es knifflige Probleme. Ich sehe sie kommen, ich werde langsamer und beobachte sie still. Dann &auml;ndere ich eine einzige Zeile des Programms und die Schwierigkeiten verschwinden wie Rauch, der sich in Luft aufl&ouml;st. Ich compiliere das Programm. Ich sitze ruhig da und lasse die Freude der Arbeit meinen Geist erf&uuml;llen. Ich schlie&szlig;e meine Augen einen Augenblick und melde mich dann ab.&rdquo; </P><P>Prinz Wang sagte: &bdquo;Ich w&uuml;nschte alle meine Programmierer w&auml;ren so weise!&rdquo;<BR></P></p>
<p>Der Beitrag <a href="/blog/buch-vier-codierung/">Buch Vier &#8211; Codierung</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-vier-codierung/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch F端nf &#8211; Wartung</title>
		<link>/blog/buch-fuenf-wartung/</link>
					<comments>/blog/buch-fuenf-wartung/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:24:02 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=216</guid>

					<description><![CDATA[<p>Buch F端nf - Wartung</p>
<p>Der Beitrag <a href="/blog/buch-fuenf-wartung/">Buch F端nf &#8211; Wartung</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch F&uuml;nf &#8211; Wartung<br /><P>So also sprach der Meisterprogrammierer: <BR>&bdquo;Jedes Programm, und sei es nur drei Zeilen lang, wird eines Tages gewartet werden m&uuml;ssen.&rdquo;</P><P class="head2">5.1</P><P>Eine viel benutzte T&uuml;r braucht kein &Ouml;l an den Angeln. Ein stetig flie&szlig;ender Strom wird nicht stehen bleiben. Weder Ger&auml;usche noch Gedanken k&ouml;nnen ein Vakuum durchwandern. Software rostet, wenn sie nicht genutzt wird. Es gibt gro&szlig;e Geheimnisse.</P><P class="head2">5.2</P><P>Ein Manager fragte den Programmierer, wie lange er noch an dem Programm arbeiten m&uuml;&szlig;te, bis es fertig w&auml;re.</P><P>&bdquo;Es wird morgen fertig sein,&rdquo; antwortete der Programmierer prompt.</P><P>&bdquo;Ich glaube das ist unrealistisch,&rdquo; sagte der Manager. &bdquo;Ehrlich wie lange wird es dauern?&rdquo;</P><P>Der Programmierer dachte einen Moment lang nach. &bdquo;Ich habe ein paar Zus&auml;tze, die ich implementieren m&ouml;chte. Das wird zwei Wochen dauern,&rdquo; sagte er schlie&szlig;lich.</P><P>&bdquo;Selbst das w&auml;re zuviel erwartet,&rdquo; sagte der Manager, &bdquo;Ich bin zufrieden wenn Sie mir einfach Bescheid geben, wenn das Programm fertig ist.&rdquo; </P><P>Der Programmierer war einverstanden. </P><P>Meherere Jahre sp&auml;ter trat der Manager zur&uuml;ck. Auf dem Weg zu seinem R&uuml;cktrittsessen fand er den Programmierer schlafend an seinem Terminal. Er hatte die ganze Nacht programmiert. </P><P class="head2">5.3</P><P>Ein Programmierer wurde beauftragt, ein einfaches Finanzprogramm zu schreiben. Der Neuling arbeitete mehrere Tage lang wie wild, aber als der Meister das Programm anschaute entdeckte er da&szlig; es einen Bildschirm-Editor enthielt, einen Satz allgemeiner Grafikroutinen, eine k&uuml;nstliche-Intelligenz-Schnittstelle, aber nicht die Spur einer finanziellen Funktion. Als der Meister ihn darauf hin ansprach, wurde der Neuling patzig: &bdquo;Seien Sie nicht so ungeduldig,&rdquo; sagte er &bdquo;ich werde den Finanzmist vielleicht nachtragen.&rdquo;</P><P class="head2">5.4</P><P>Vernachl&auml;ssigt ein guter Bauer eine Pflanze, die er s&auml;te?</P><P>&Uuml;bersieht ein guter Lehrer selbst den d&uuml;mmsten Sch&uuml;ler? </P><P>L&auml;&szlig;t ein guter Vater zu, da&szlig; auch nur ein einziges Kind verhungert? </P><P>Weist ein guter Programmierer es zur&uuml;ck, sein Programm zu warten? </P></p>
<p>Der Beitrag <a href="/blog/buch-fuenf-wartung/">Buch F端nf &#8211; Wartung</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-fuenf-wartung/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Sechs &#8211; Management</title>
		<link>/blog/buch-sechs-management/</link>
					<comments>/blog/buch-sechs-management/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:23:33 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=215</guid>

					<description><![CDATA[<p>Buch Sechs - Management</p>
<p>Der Beitrag <a href="/blog/buch-sechs-management/">Buch Sechs &#8211; Management</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Sechs &#8211; Management<br /><P>So also sprach der Meisterprogrammierer: <BR>&bdquo;La&szlig; es auf der Welt viele Programmierer und wenige Manager geben, dann werden alle produktiv sein.&rdquo;</P><P class="head2">6.1</P><P>Wenn Manager endlose Besprechungen haben, dann schreiben Programmierer Spiele. Wenn Bankangestellte &uuml;ber viertelj&auml;hrliche Profite reden, dann wird Geld f&uuml;r die Entwicklung gestrichen. Wenn t&uuml;chtige Wissenschaftler &uuml;ber blauen Himmel reden, dann ziehen dunkle Wolken auf.</P><P>Dies ist sicherlich nicht das Tao der Programmierung.</P><P>Wenn Manager Versprechungen machen, dann werden Spiele ignoriert. Wenn Bankangestellte langfristige Planungen machen, dann kommen Harmonie und Ordnung wieder. Wenn t&uuml;chtige Wissenschaftler auf Probleme hinweisen, dann werden sie schnell gel&ouml;st werden.</P><P>Dies ist auf jeden Fall das Tao der Programmierung.</P><P class="head2">6.2</P><P>Warum sind Programmierer nicht produktiv? Weil ihre Zeit in Besprechungen verschwendet wird.</P><P>Warum sind Programmierer rebellisch? Weil sich das Management zu stark einmischt.</P><P>Warum k&uuml;ndigt ein Programmierer nach dem anderen? Weil sie ausgebrannt sind.</P><P>Wenn sie unter schlechtem Management arbeiten, dann wissen sie ihren Beruf nicht mehr zu sch&auml;tzen.</P><P class="head2">6.3</P><P>Ein Manager war kurz davor, gefeuert zu werden, aber ein Programmierer, der f&uuml;r ihn arbeitete, erfand ein neues Programm, das ber&uuml;hmt wurde und sich sehr gut verkaufte. Das Ergebnis war, da&szlig; der Manager seinen Job wiederbekam.<BR>Der Manager versuchte, dem Programmierer einen Bonus zu geben, aber der wies ihn zur&uuml;ck und sagte: &bdquo;Ich schrieb das Programm, weil ihm ein interessantes Konzept zu grunde lag und deswegen erwarte ich keine Belohnung.&rdquo;</P><P>Nachdem er dies geh&ouml;rt hatte, sagte der Manager: &bdquo;Dieser Programmierer, obwohl er von niedrigem Rang ist, versteht die Aufgaben eines Angestellten gut. La&szlig;t ihn uns zu einer gehobenen Position im Management bef&ouml;rdern.&rdquo; </P><P>Aber als er es dem Programmierer sagte wies dieser ihn abermals zur&uuml;ck. &bdquo;Ich lebe, damit ich programmiere. Wenn ich bef&ouml;rdert werde, w&uuml;rde ich nichts anderes tun, als anderer Leute Zeit zu verschwenden. Kann ich jetzt gehen? Ich habe ein Programm das fertig werden mu&szlig;.&rdquo;</P><P class="head2">6.4</P><P>Ein Manager ging zu seinen Programmierern und wies sie an: &bdquo;Zur Beachtung ihrer Arbeitszeiten: Sie haben morgens um neun zu kommen und abends um f&uuml;nf zu gehen!&rdquo; Als sie das h&ouml;rten, waren alle ver&auml;rgert und viele k&uuml;ndigten auf der Stelle.</P><P>Darauf sagte der Manager: &bdquo;Schon gut. In diesem Fall k&ouml;nnen sie sich ihre eigenen Arbeitszeiten festlegen, solange sie ihre Programme termingerecht abliefern.&rdquo;</P><P>Die Programmierer waren zufrieden und kamen mittags um z&ouml;lf um bis in die fr&uuml;hen Morgenstunden zu arbeiten.</P></p>
<p>Der Beitrag <a href="/blog/buch-sechs-management/">Buch Sechs &#8211; Management</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-sechs-management/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Sieben &#8211; Vereinigte Weisheit</title>
		<link>/blog/buch-sieben-vereinigte-weisheit/</link>
					<comments>/blog/buch-sieben-vereinigte-weisheit/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:23:02 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=214</guid>

					<description><![CDATA[<p>Buch Sieben - Vereinigte Weisheit</p>
<p>Der Beitrag <a href="/blog/buch-sieben-vereinigte-weisheit/">Buch Sieben &#8211; Vereinigte Weisheit</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Sieben &#8211; Vereinigte Weisheit<br /><P>So also sprach der Meisterprogrammierer: <BR>&bdquo;Du kannst einem Chef ein Programm erkl&auml;ren, aber du kannst aus ihm keinen Computerspezialisten machen.</P><P class="head2">7.1 </P><P>Ein Sch&uuml;ler fragte den Meister: &bdquo;Im Osten gibt es eine m&auml;chtige Organisationsstruktur, die &#8216;Vereinigtes Hauptquartier&#8217; genannt wird. Sie ist aufgebl&auml;ht zu einem unf&ouml;rmigen Etwas mit Vize-Pr&auml;sidenten und Angestellten. Es gibt eine Unmenge von Befehlen, die sagen &#8216;Geh&#8217; hierhin!&#8217; oder &#8216;Geh&#8217; dorthin!&#8217; und niemand wei&szlig;, was damit gemeint ist. Jedes Jahr kommen neue Namen in die Verzeichnisse aber ohne Ergebnis. Wie kann ein solch unnat&uuml;rliches Ding existieren?&rdquo;</P><P>Der Meister antwortete: &bdquo;Du erkennst diese gewaltige Struktur und es st&ouml;rt dich, da&szlig; es keinen rationalen Grund f&uuml;r ihr Bestehen gibt. Ringt dir dieses endlose Rotieren im Management kein L&auml;cheln ab? Genie&szlig;t du nicht die ungest&ouml;rte Ruhe unter ihrer besch&uuml;tzenden F&uuml;hrung? Warum st&ouml;rt dich dann die Sinnlosigkeit dieser Organisation?</P><P class="head2">7.2</P><P>Im Osten gibt es einen Haifisch, der ist gr&ouml;&szlig;er als alle anderen Fische. Er verwandelt sich in einen Vogel, dessen Fl&uuml;gel wie gro&szlig;e Wolken sind, die den Himmel verdecken. Wenn dieser Vogel &uuml;ber das Land fliegt, so bringt er eine Botschaft vom Einheitlichen Hauptquartier. Diese Botschaft f&auml;llt mitten auf die Programmierer im Land wie eine Seem&ouml;we, die ihr Revier auf dem Strand markiert. </P><P>Bald darauf steigt der Vogel auf den Schwingen des Windes in den blauen Himmel auf und kehrt nach Hause zur&uuml;ck. Der Programmiererneuling starrt diesen Vogel in tiefer Demut an, denn er versteht nicht, was es bedeutet. Der durchschnittliche Programmierer zittert vor dem Vogel, denn er f&uuml;rchtet seine Botschaft. Der Meisterprogrammierer f&auml;hrt mit seiner Arbeit am Terminal fort, denn er wei&szlig; nichts vom Kommen und Gehen des Vogels. </P><P class="head2">7.3</P><P>Der Zauberer im Elfenbeinturm brachte seine neue Erfindung zum Meisterprogrammierer, damit er sie inspiziere. Der Zauberer rollte eine gro&szlig;e schwarze Kiste in das Arbeitszimmer des Meisters, w&auml;hrend dieser still abwartete. </P><P>&bdquo;Dies ist eine integrierte verteilte vereinheitlichte Arbeitsstation,&rdquo; begann der Zauberer, &bdquo;entwickelt nach ergonomischen Gesichtspunkten, mit einem propriet&auml;ren Betriebssystem, Sprachen der 6. Generation und s&auml;mtlichen Schnittstellen, die gerade in Mode sind. Mein Assistent hat es mit mehreren hundert Leuten und in vielen Jahren harter Arbeit entwickelt. Ist es nicht fantastisch?&rdquo;</P><P>Der Meister zog nur leicht seine Augenbrauen hoch. &bdquo;Es ist in der Tat fantastisch,&rdquo; sagte er.</P><P>&bdquo;Das Einheitliche Hauptquartier hat angeordnet,&rdquo; sprach der Zauberer weiter, &bdquo;da&szlig; jeder dieses System als Plattform f&uuml;r seine neuen Programme benutzen soll. Stimmen Sie dem zu?&rdquo;</P><P>&bdquo;Selbstverst&auml;ndlich,&rdquo; antwortete der Meister, &bdquo;werde ich es sofort in unser Rechenzentrum bringen!&rdquo;</P><P>Und der Zauberer kehrte gl&uuml;cklich und zufrieden in seinen Elfenbeinturm zur&uuml;ck. Mehrere Tage sp&auml;ter kam ein Sch&uuml;ler in das B&uuml;ro des Meisters und sagte: &bdquo;Ich kann das Listing f&uuml;r mein neues Programm nicht finden. Sie wissen wohl nicht, wo es sein k&ouml;nnte?&rdquo;</P><P>&bdquo;Doch,&rdquo; gab der Meister zur&uuml;ck. &bdquo;Das Listing steckt in der Plattform im Rechenzentrum. </P><P class="head2">7.4</P><P>Der Meisterprogrammierer entwickelt sich, um ohne Angst programmieren zu k&ouml;nnen. </P><P>Kein Wechsel im Management kann ihm was anhaben. </P><P>Er wird nicht gefeuert werden, selbst wenn das Projekt abgebrochen wird. </P><P>Wie kann das sein? </P><P>Er ist vom Tao erf&uuml;llt. </P></p>
<p>Der Beitrag <a href="/blog/buch-sieben-vereinigte-weisheit/">Buch Sieben &#8211; Vereinigte Weisheit</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-sieben-vereinigte-weisheit/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Acht &#8211; Hardware und Software</title>
		<link>/blog/buch-acht-hardware-und-software/</link>
					<comments>/blog/buch-acht-hardware-und-software/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:22:33 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=213</guid>

					<description><![CDATA[<p>Buch Acht - Hardware und Software</p>
<p>Der Beitrag <a href="/blog/buch-acht-hardware-und-software/">Buch Acht &#8211; Hardware und Software</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Acht &#8211; Hardware und Software<br /><P>So also sprach der Meisterprogrammierer: <BR>&bdquo;Ohne den Wind bewegt sich das Gras nicht. Ohne Software ist die Hardware nutzlos.&rdquo;</P><P class="head2">8.1</P><P>Ein Neuling fragte den Meister: &bdquo;Ich habe bemerkt, da&szlig; eine Computerfirma gr&ouml;&szlig;er ist, als alle anderen. Sie &uuml;berragt ihre Konkurrenz wie ein Riese kleine Zwerge &uuml;berragt. Jede ihrer Abteilungen k&ouml;nnte eine eigene Firma sein. Wie kann das sein?&rdquo;</P><P>Der Meister antwortete: &bdquo;Warum stellst du so dumme Fragen? Diese Firma ist gro&szlig;, weil sie gro&szlig; ist. Wenn sie nur Hardware produzierte, dann w&uuml;rde niemand die Produkte kaufen. Wenn sie nur Software entwickeln w&uuml;rde, dann w&uuml;rde niemand sie benutzen. Wenn sie nur andere Systeme warten w&uuml;rde, dann behandelten die Leute sie wie einen Diener. Weil sie aber diese drei Sachen kombiniert, denken die Leute, sie sei ein Gott! Sie gewinnt ohne Anstrengung weil sie nicht versucht zu streben.&rdquo;</P><P class="head2">8.2</P><P>Ein Meisterprogrammierer traf eines Tages einen Sch&uuml;ler. Der Meister bemerkte, wie gefangen der Sch&uuml;ler von einem Videospiel war. </P><P>&bdquo;Entschuldige bitte,&rdquo; sagte er, &bdquo;kann ich das mal sehen?&rdquo; </P><P>Der Sch&uuml;ler schenkte dem Meister seine Aufmerksamkeit und gab ihm das Spiel. </P><P>&bdquo;Ich sehe, das Spiel hat drei Schwierigkeitsstufen: einfach normal und schwer,&rdquo; sagte der Meister. &bdquo;Es gibt bei diesen Spielen noch eine Stufe, bei der das Spiel weder siegen noch besiegt werden m&ouml;chte.&rdquo; </P><P>&bdquo;Bitte sag mir, Meister,&rdquo; fragte der Sch&uuml;ler, &bdquo;wie finde ich diese mysteri&ouml;sen Einstellungen?&rdquo;</P><P>Der Meister warf das Spiel zu Boden und zerstampfte es unter seinen F&uuml;&szlig;en. Und pl&ouml;tzlich war der Sch&uuml;ler erleuchtet. </P><P class="head2">8.3</P><P>Es gab einmal einen Programmierer, der an Kleincomputern arbeitete. &bdquo;Sieh selbst, wie gut es mir hier geht,&rdquo; sagte er zu einem Kollegen, der Gro&szlig;computer programmiert und ihn besuchte. </P><P>&bdquo;Ich habe mein eigenes Betriebssystem und Datensicherungseinheit. Ich mu&szlig; meine Ressourcen mit keinem sonst teilen. Die Programme sind stabil und leicht zu benutzen. Warum k&uuml;ndigen Sie nicht Ihren Job und leisten mir hier Gesellschaft?&rdquo;</P><P>Der Gro&szlig;computerprogrammierer begann daraufhin seinem Freund sein System zu beschreiben: &bdquo;Der Gro&szlig;computer ist wie ein altert&uuml;mlicher Weiser der inmitten des Rechenzentrums sitzt und meditiert. Seine Diskettenlaufwerke reihen sich endlos aneinander, wie ein gro&szlig;er Ozean aus Maschinen. Die Programme haben die unterschiedlichsten Auspr&auml;gungen, facettenreich wie ein geschliffener Diamant und verschlungen wie ein Urwald. Jedes Programm ist einzigartig und sprudelt durch das System wie ein lebendiger Quell. Deswegen bin ich gl&uuml;cklich, wo ich bin.&rdquo; </P><P>Der Kleincomputerprogrammierer war daraufhin ruhig. Aber die beiden Programmierer blieben Freunde bis an ihr Lebensende.</P><P class="head2">8.4</P><P>Hardware traf Software auf der Stra&szlig;e nach Changtse. Software sagte: &bdquo;Du bist Yin und ich bin Yang. Wenn wir gemeinsam reisen, werden wir ber&uuml;hmt werden und eine Unmenge Geld verdienen.&rdquo; </P><P>So setzten sie also ihre Reise gemeinsam fort mit dem Gedanken, die Welt zu erobern. Auf einmal trafen sie die Startroutine, die mit einer alten Kutte bekleidet war und an einem verknorpelten Stock dahinhumpelte. Sie sagte zu ihnen: &bdquo;Das Tao liegt jenseits von Yin und Yang. Es ist ruhig und leise wie ein Ozean, weswegen auch niemand wei&szlig;, da&szlig; es da ist. Es strebt nicht nach Erf&uuml;llung, denn es ist in sich vollkommen. Es existiert jenseits von Raum und Zeit.&rdquo;</P><P>Software und Hardware kehrten besch&auml;mt nach Hause zur&uuml;ck. </P></p>
<p>Der Beitrag <a href="/blog/buch-acht-hardware-und-software/">Buch Acht &#8211; Hardware und Software</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-acht-hardware-und-software/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Neun &#8211; Epilog</title>
		<link>/blog/buch-neun-epilog/</link>
					<comments>/blog/buch-neun-epilog/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:22:04 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=212</guid>

					<description><![CDATA[<p>Buch Neun - Epilog</p>
<p>Der Beitrag <a href="/blog/buch-neun-epilog/">Buch Neun &#8211; Epilog</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Neun &#8211; Epilog<br />Also sprach der Meisterprogrammierer:<BR>&bdquo;Zeit f&uuml;r dich zu gehen.&rdquo;</p>
<p>Der Beitrag <a href="/blog/buch-neun-epilog/">Buch Neun &#8211; Epilog</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-neun-epilog/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
		<item>
		<title>Buch Eins &#8211; Die Stille Leere</title>
		<link>/blog/buch-eins-die-stille-leere/</link>
					<comments>/blog/buch-eins-die-stille-leere/#comments</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 16 Mar 2004 22:21:34 +0000</pubDate>
				<category><![CDATA[Das Tao der Programmierung]]></category>
		<category><![CDATA[tao]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=211</guid>

					<description><![CDATA[<p>Buch Eins - Die Stille Leere</p>
<p>Der Beitrag <a href="/blog/buch-eins-die-stille-leere/">Buch Eins &#8211; Die Stille Leere</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Buch Eins &#8211; Die Stille Leere<br /><P>So also sprach der Meisterprogrammierer:<BR>&bdquo;Wenn du gelernt hast, das Programm von den fehlerhaften Zeilen zu entfernen, dann ist es Zeit f&uuml;r dich zu gehen.&rdquo;</P><P class="head2">1.1 </P><P class="text1">Etwas Mysteri&ouml;ses entsteht, hervorgebracht aus der stillen Leere. Es wartet alleine und unbeweglich gleichzeitig, ruhig und doch in st&auml;ndiger Bewegung. Es ist die Quelle aller Programme. Ich kenne seinen Namen nicht, deshalb nenne ich es das Tao der Programmierung.</P><P>Wenn das Tao m&auml;chtig ist, so ist das Betriebssystem m&auml;chtig. </P><P>Wenn das Betriebssystem m&auml;chtig ist, dann ist der Compiler m&auml;chtig. </P><P>Wenn der Compiler m&auml;chtig ist, dann ist die Anwendung m&auml;chtig. </P><P>Der Benutzer ist zufrieden und die Welt ist im Einklang. Das Tao der Programmierung flie&szlig;t weit weg und kommt zur&uuml;ck auf den Schwingen des neuen Tages.&nbsp; </P><P class="head2">1.2</P><P>Das Tao gebar die Maschinensprache. </P><P>Die Maschinensprache gebar den Assembler. </P><P>Der Assembler gebar den Compiler. </P><P>Nun gibt es zehntausend Sprachen. Jede Sprache hat ihren eigenen Zweck, so unbedeutend er auch sein mag. Jede Sprache stellt Yin und Yang der Software dar. </P><P>Jede Sprache hat ihren Platz im Tao. </P><P>Aber programmiere nicht in COBOL wenn du es vermeiden kannst. </P><P class="head2">1.3 </P><P>Am Anfang war das Tao. </P><P>Das Tao gebar Raum und Zeit. Deswegen sind Raum und Zeit das Yin und Yang der Programmierung. Den Programmierern, die das Tao nicht begreifen, werden jedesmal weder Zeit noch Raum f&uuml;r ihre Programme reichen. </P><P>Die Programmierer die das Tao begreifen, werden immer Zeit und Raum genug haben, um ihre Ziele zu verwirklichen. </P><P>Wie sollte es auch sonst sein? </P><P class="head2">1.4</P><P>Dem weisen Programmierer wird vom Tao erz&auml;hlt und er befolgt es. </P><P>Dem durchschnittlichen Programmierer wird vom Tao erz&auml;hlt und er sucht danach.</P><P>Dem dummen Programmierer wird vom Tao erz&auml;hlt und er lacht dar&uuml;ber.</P><P>Wenn es dar&uuml;ber nichts zu lachen g&auml;be dann g&auml;be es kein Tao. Die h&ouml;chsten T&ouml;ne sind am schwierigsten zu h&ouml;ren. Vorw&auml;rts zu gehen bedeutet R&uuml;ckschl&auml;ge einzustecken. Wahres Talent zeigt sich erst sp&auml;t im Leben. Selbst ein perfektes Programm hat noch Fehler.&nbsp; </P></p>
<p>Der Beitrag <a href="/blog/buch-eins-die-stille-leere/">Buch Eins &#8211; Die Stille Leere</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/buch-eins-die-stille-leere/feed/</wfw:commentRss>
			<slash:comments>4</slash:comments>
		
		
		
		<series:name><![CDATA[Das Tao der Programmierung]]></series:name>
	</item>
	</channel>
</rss>
