<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"
	xmlns:content="http://purl.org/rss/1.0/modules/content/"
	xmlns:wfw="http://wellformedweb.org/CommentAPI/"
	xmlns:dc="http://purl.org/dc/elements/1.1/"
	xmlns:atom="http://www.w3.org/2005/Atom"
	xmlns:sy="http://purl.org/rss/1.0/modules/syndication/"
	xmlns:slash="http://purl.org/rss/1.0/modules/slash/"
	xmlns:series="https://publishpress.com/"
	>

<channel>
	<title>CATT/ eCATT Archive - Tricktresor</title>
	<atom:link href="/blog/keywords/catt-ecatt/feed/" rel="self" type="application/rss+xml" />
	<link></link>
	<description>Tipps und Tricks zu SAP R/3</description>
	<lastBuildDate>Fri, 29 Nov 2013 16:59:39 +0000</lastBuildDate>
	<language>de-DE</language>
	<sy:updatePeriod>
	hourly	</sy:updatePeriod>
	<sy:updateFrequency>
	1	</sy:updateFrequency>
	<generator>https://wordpress.org/?v=6.4.3</generator>

<image>
	<url>/wp-content/uploads/2019/02/cropped-Tricktresor-favicon-2019-32x32.png</url>
	<title>CATT/ eCATT Archive - Tricktresor</title>
	<link></link>
	<width>32</width>
	<height>32</height>
</image> 
	<item>
		<title>Testskript anlegen</title>
		<link>/blog/testskript-anlegen/</link>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Thu, 11 Oct 2007 16:23:01 +0000</pubDate>
				<category><![CDATA[Cross Applications]]></category>
		<category><![CDATA[CATT/ eCATT]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=441</guid>

					<description><![CDATA[<p>Hier erfahren Sie kurz, wie Sie ein Testskript anlegen. Dies ist sehr einfach, da nur wenige Verwaltungsdaten gef&#252;llt werden m&#252;ssen.</p>
<p>Der Beitrag <a href="/blog/testskript-anlegen/">Testskript anlegen</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Hier erfahren Sie kurz, wie Sie ein Testskript anlegen. Dies ist sehr einfach, da nur wenige Verwaltungsdaten gef&uuml;llt werden m&uuml;ssen.<br /><P>Starten Sie die Transaktion SECATT und tragen Sie den Namen ZTT1 bei &#8220;Testskript&#8221; ein. Dr&uuml;cken Sie dann F5 zum Anlegen des Skripts.</P><P class="head1">Attribute</P><P>Unter dem Reiter &#8220;Attribute&#8221; m&uuml;ssen Sie lediglich die Bezeichnung und die Komponentenzuordnung pflegen. </P><P>Als Verantwortlicher k&ouml;nnen&nbsp;SAP-User (standardm&auml;&szlig;ig der anlegende Benutzer)also auch Verantwortliche aus einer Aufbauorganisation genannt werden.</P><P>Alles andere (Suchbegriffe, Versionsdaten, Zus&auml;tze, Einschr&auml;nkungen) m&uuml;ssen ersteinmal nicht beachtet werden. Wenn Sie das CATT-Fieber gepackt hat, werden Sie schnell herausfinden, ob und wie Sie die&nbsp;einzelnen Attribute verwenden m&uuml;ssen.</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/CATT/secatt_attr.jpg"><BR>Attribute eines Testskripts</P></TD></TR></TBODY></TABLE></P><P class="head1">Editor</P><P>Unter dem Reiter &#8220;Editor&#8221; finden Sie ein zweigeteiltes Fenster: Der obere Teil ist f&uuml;r Parameter reserviert, im unteren Teil befindet sich der Editor.</P><P>Wir definieren nun ein kleines Skript, das lediglich eine Meldung im Protokoll ausgibt. </P><P class="head2">Parameter anlegen</P><P>Legen Sie dazu den Parameter V_USER an, indem Sie im oberen Teil des Bildschirm auf den Knopf &#8220;Parameter anh&auml;ngen&#8221; oder &#8220;Parameter einf&uuml;gen&#8221; dr&uuml;cken.</P><P>Sie bekommen eine leere Eingabezeile. In &#8220;Parameter&#8221; tragen Sie den Namen des Parameters ein: &#8220;V_UNAME&#8221;. In der Spalte &#8220;I/E/V&#8221; tragen Sie bitte ein &#8220;V&#8221; (f&uuml;r Variable) ein und in der Spalte &#8220;Bezug des Parameters&#8221; das Datenelement &#8220;XUBNAME&#8221;. Dr&uuml;cken Sie dann Enter und die Bezeichnung wird aus dem Datenlement gef&uuml;llt.</P><P class="head2">Skript definieren</P><P>Wechseln Sie nun in das Editorfenster. Als ersten Befehl wollen wir die Variable V_UNAME mit dem Anmeldenamen des Users f&uuml;llen, der das Skript ausf&uuml;hrt:</P><P>V_UNAME = SY-UNAME.</P><P>Sodann soll eine Meldung erzeugt werden, die dar&uuml;ber informiert, dass der Anwender das Skript ausgef&uuml;hrt hat. Dies ist eigentlich nicht n&ouml;tig, da dies eh protokolliert wird, aber wir tun es trotzdem noch einmal.</P><P>Den LOG-Befehl f&uuml;gen wir &uuml;ber ein Muster ein. Dr&uuml;cken Sie dazu STRG-F6 oder die Taste &#8220;Muster&#8221; in der GUI-Leiste.</P><P>Es &ouml;ffnet sich das Fenster zum Einf&uuml;gen von Mustern:</P><P><IMG src="/wp-content/uploads/tt_images/CATT/secatt_log_muster.jpg"></P><P>Die Schnittstelle ist wichtig, da hier Daten eingetragen werden.</P><P>Im Editor ist nun die folgende Zeile hinzugekommen:</P><P>LOGMSG ( LOGMSG_1 ).</P><P>Klicken Sie bitte doppelt auf das in Klammern stehende LOGMSG_1. Es &ouml;ffnet sich dann neben dem Editorfenster ein weiteres. Tragen Sie die folgenden Daten ein:</P><P><IMG src="/wp-content/uploads/tt_images/CATT/secatt_log_edit.jpg"></P><P class="head2">Pr&uuml;fen und Sichern</P><P>Ihr erstes kleines Testskript ist nun fertig und Sie k&ouml;nnen es sichern und pr&uuml;fen. Wenn Sie alles richtig gemacht haben, erscheint die Meldung: Es wurden keine Syntaxfehler gefunden.</P><P>Danach&nbsp;k&ouml;nnen Sie das Skript mit F8 ausf&uuml;hren. Es erscheint dann ein Bildschirm, in dem viele Startoptionen f&uuml;r das Skript einstellbar sind. In unserem Fall m&uuml;ssen Sie sich um nichts k&uuml;mmern, dr&uuml;cken Sie einfach erneut F8 um das Skript nun wirklich auszuf&uuml;hren.</P><P>Nach Beendigung wird das Protokoll ausgegeben:</P><P><IMG src="/wp-content/uploads/tt_images/CATT/secatt_protokoll.jpg"></P><P>Ganz unten sehen Sie die vom Testskript erzeugte Meldung. Anhand der vielen bunten Icons und Eintr&auml;ge l&auml;sst sich vielleicht erahnen, wie umfangreich die Protokollierung der Skripte tats&auml;chlich ist.</P></p>
<p>Der Beitrag <a href="/blog/testskript-anlegen/">Testskript anlegen</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
		
		
			</item>
		<item>
		<title>BAPIs einbinden</title>
		<link>/blog/bapis-einbinden/</link>
					<comments>/blog/bapis-einbinden/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 02 Oct 2007 15:20:06 +0000</pubDate>
				<category><![CDATA[Cross Applications]]></category>
		<category><![CDATA[CATT/ eCATT]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=438</guid>

					<description><![CDATA[<p>Im Gegensatz zu CATT ist es beim eCATT m&#246;glich, Funktionsbausteine (BAPIs) einzubinden und die Schnittstellen zu versorgen. So kann ein richtiger Programmablauf modelliert werden.</p>
<p>Der Beitrag <a href="/blog/bapis-einbinden/">BAPIs einbinden</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Im Gegensatz zu CATT ist es beim eCATT m&ouml;glich, Funktionsbausteine (BAPIs) einzubinden und die Schnittstellen zu versorgen. So kann ein richtiger Programmablauf modelliert werden.</p>
<p>Der Beitrag <a href="/blog/bapis-einbinden/">BAPIs einbinden</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/bapis-einbinden/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
			</item>
		<item>
		<title>Allgemein</title>
		<link>/blog/allgemein/</link>
					<comments>/blog/allgemein/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 02 Oct 2007 15:17:51 +0000</pubDate>
				<category><![CDATA[Cross Applications]]></category>
		<category><![CDATA[CATT/ eCATT]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=437</guid>

					<description><![CDATA[<p>Allgemeine Informationen &#252;ber das Tool CATT bzw. eCATT. Wir zeigen eine kurze &#220;bersicht &#252;ber die Steuerungs- und Anwendungsm&#246;glichkeiten des Tools.</p>
<p>Der Beitrag <a href="/blog/allgemein/">Allgemein</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Allgemeine Informationen &uuml;ber das Tool CATT bzw. eCATT. Wir zeigen eine kurze &Uuml;bersicht &uuml;ber die Steuerungs- und Anwendungsm&ouml;glichkeiten des Tools.<br /><P>CATT und eCATT (Computer Aided Test Tool) ist eine Umfangreiche Anwendung mit der Testdaten eingespielt und ausgewertet werden k&ouml;nnen.</P><P>Es sind umfangreiche Zeitplanungen m&ouml;glich. So kann abgesch&auml;tzt werden, wie lange f&uuml;r ein bestimmtes Test-Szenario ben&ouml;tigt wird.</P><P>Die abgespielten Abl&auml;ufe werden umfangreich protokolliert, so dass eine pr&auml;zise Nachverfolgung m&ouml;glich ist.</P><P>Es k&ouml;nnen Testskripte erstellt werden, die einen bestimmten Ablauf&nbsp;abbilden. Hierbei k&ouml;nnen Transaktionsaufzeichnungen ebenso verwendet werden wie Funktionsbausteinaufrufe. Ebenfalls m&ouml;glich sind Steuerungsm&ouml;glichkeiten anhand von Returncodes oder anderen&nbsp;Variablenwerten. </P><P>Daten k&ouml;nnen manuell eingetragen werden oder auch aus einer Text- oder Excel-Datei eingelesen werden.</P><P>Einmal erstellt kann ein Test-Skript viel Tipp-Arbeit ersparen.</P><P>Transaktion <STRONG>SCAT</STRONG> ist die alte Version des Testtools.</P><P>Die neuere und wesentlich umfangreichere Version des Testtools wird mit Transaktion <STRONG>SECATT</STRONG> gestartet.</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/CATT/secatt.jpg"><BR>Startbild des Testtools SECATT</P></TD></TR></TBODY></TABLE></P><P>Der folgende Screenshot l&auml;sst die M&ouml;glichkeiten erahnen, die sich bieten&#8230;</P><P><IMG src="/wp-content/uploads/tt_images/CATT/secatt_2.jpg"></P></p>
<p>Der Beitrag <a href="/blog/allgemein/">Allgemein</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/allgemein/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
			</item>
		<item>
		<title>Daten aufzeichnen</title>
		<link>/blog/daten-aufzeichnen/</link>
					<comments>/blog/daten-aufzeichnen/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 02 Oct 2007 15:15:33 +0000</pubDate>
				<category><![CDATA[Cross Applications]]></category>
		<category><![CDATA[CATT/ eCATT]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=436</guid>

					<description><![CDATA[<p>Hier eine kurze Information, wie Sie Daten innerhalb des Testtools aufzeichnen k&#246;nnen.</p>
<p>Der Beitrag <a href="/blog/daten-aufzeichnen/">Daten aufzeichnen</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Hier eine kurze Information, wie Sie Daten innerhalb des Testtools aufzeichnen k&ouml;nnen.<br />Ebenso wie in der Transaktion SM35 k&ouml;nnen hier Transaktionen aufgezeichnet werden. </p>
<p>Der Beitrag <a href="/blog/daten-aufzeichnen/">Daten aufzeichnen</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/daten-aufzeichnen/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
			</item>
		<item>
		<title>Daten einspielen</title>
		<link>/blog/daten-einspielen/</link>
					<comments>/blog/daten-einspielen/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Tue, 02 Oct 2007 13:11:04 +0000</pubDate>
				<category><![CDATA[Cross Applications]]></category>
		<category><![CDATA[CATT/ eCATT]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=435</guid>

					<description><![CDATA[<p>Mithilfe von Excel oder einer anderen Tabellenkalkulation ist es m&#246;glich, mithilfe des Testtools Daten aus Dateien in das System einzuspielen. Dabei k&#246;nnen Transaktionsaufzeichnungen verwendet werden, als auch BAPIs.</p>
<p>Der Beitrag <a href="/blog/daten-einspielen/">Daten einspielen</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Mithilfe von Excel oder einer anderen Tabellenkalkulation ist es m&ouml;glich, mithilfe des Testtools Daten aus Dateien in das System einzuspielen. Dabei k&ouml;nnen Transaktionsaufzeichnungen verwendet werden, als auch BAPIs.</p>
<p>Der Beitrag <a href="/blog/daten-einspielen/">Daten einspielen</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/daten-einspielen/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
			</item>
	</channel>
</rss>
