<?xml version="1.0" encoding="UTF-8"?><rss version="2.0"
	xmlns:content="http://purl.org/rss/1.0/modules/content/"
	xmlns:wfw="http://wellformedweb.org/CommentAPI/"
	xmlns:dc="http://purl.org/dc/elements/1.1/"
	xmlns:atom="http://www.w3.org/2005/Atom"
	xmlns:sy="http://purl.org/rss/1.0/modules/syndication/"
	xmlns:slash="http://purl.org/rss/1.0/modules/slash/"
	xmlns:series="https://publishpress.com/"
	>

<channel>
	<title>HR Archive - Tricktresor</title>
	<atom:link href="/blog/keywords/hr/feed/" rel="self" type="application/rss+xml" />
	<link></link>
	<description>Tipps und Tricks zu SAP R/3</description>
	<lastBuildDate>Fri, 29 Nov 2013 16:59:41 +0000</lastBuildDate>
	<language>de-DE</language>
	<sy:updatePeriod>
	hourly	</sy:updatePeriod>
	<sy:updateFrequency>
	1	</sy:updateFrequency>
	<generator>https://wordpress.org/?v=6.4.3</generator>

<image>
	<url>/wp-content/uploads/2019/02/cropped-Tricktresor-favicon-2019-32x32.png</url>
	<title>HR Archive - Tricktresor</title>
	<link></link>
	<width>32</width>
	<height>32</height>
</image> 
	<item>
		<title>Die Erweiterung von PA-Infotypen mittels PM01</title>
		<link>/blog/die-erweiterung-von-pa-infotypen-mittels-pm01/</link>
					<comments>/blog/die-erweiterung-von-pa-infotypen-mittels-pm01/#respond</comments>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Sat, 04 Jun 2005 14:46:54 +0000</pubDate>
				<category><![CDATA[Human Resources]]></category>
		<category><![CDATA[HR]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=336</guid>

					<description><![CDATA[<p>In manchen F&#228;llen ist es gew&#252;nscht, zus&#228;tzliche firmenspezifische Informationen innerhalb von Infotypen zu erfassen, f&#252;r die im SAP Standard keine entsprechenden Datenfelder vorgesehen sind. SAP hat die M&#246;glichkeit vorgesehen, einen Standard Infotypen um sog. Customer-Includes (CI) zu erweitern. Lesen Sie in diesem Tutorial, wie Sie eine solche Erweiterung in Form eines kundeneigenes Zusatzfeldes innerhalb des Infotypen Anschriften (0006) mit nur wenig Aufwand realisieren k&#246;nnen.</p>
<p>Der Beitrag <a href="/blog/die-erweiterung-von-pa-infotypen-mittels-pm01/">Die Erweiterung von PA-Infotypen mittels PM01</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>In manchen F&auml;llen ist es gew&uuml;nscht, zus&auml;tzliche firmenspezifische Informationen innerhalb von Infotypen zu erfassen, f&uuml;r die im SAP Standard keine entsprechenden Datenfelder vorgesehen sind. SAP hat die M&ouml;glichkeit vorgesehen, einen Standard Infotypen um sog. Customer-Includes (CI) zu erweitern. Lesen Sie in diesem Tutorial, wie Sie eine solche Erweiterung in Form eines kundeneigenes Zusatzfeldes innerhalb des Infotypen Anschriften (0006) mit nur wenig Aufwand realisieren k&ouml;nnen.<br /><P class="head1">&nbsp;</P><P class="head1">Die Erweiterungstransaktionen PM01 und PPCI</P><P>Die entsprechende Transaktion f&uuml;r die Erweiterung von PA-Infotypen lautet <STRONG>PM01</STRONG>. F&uuml;r PD-Infotypen w&auml;re die Transaktion <STRONG>PPCI</STRONG> heranzuziehen. Neben der Erweiterung eines bestehenden PA-Infotypen um zus&auml;tzliche Datenfelder bietet <STRONG>PM01</STRONG> noch die folgenden M&ouml;glichkeiten:</P><UL><LI>Anlage eines neuen, kundeneigenen PA-Infotypen (zu beachten ist hier die Namenr&auml;ume siehe unten). <LI>Kopieren eines bestehenden Standard PA-Infotypen in einen kundeneigenen Infotypen. Dies hat den Vorteilt, dass der kopierte Infotyp evtl. bereits einige der gew&uuml;nschten Funktionalit&auml;ten liefert. <LI>Erweiterung des Listbildes (&Uuml;berblick) eines Standard PA-Infotypen. <LI>Die L&ouml;schung eines zuvor angelegten kundeneigenen PA-Infotypen. <LI>Anlage von Schnellerfassungsma&szlig;nahmen (Transaktion PA42) bzw. des entsprechenden Erfassungsdynpros.<BR><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp1.jpg"><BR>Bild1: Infotyperweiterungen mit Transaktion PM01</P></TD></TR></TBODY></TABLE></P></LI></UL><P>Wissenswert ist, dass zus&auml;tzliche Datenfelder die mittels <STRONG>PM01</STRONG> erzeugt wurden, in Bezug auf das Reporting, innerhalb der dynamischen Ma&szlig;nahmen, der Belegschreibung usw. wie Felder des SAP-Standards behandelt werden. Dies hat beispielsweise den gro&szlig;en Vorteil, dass diese innerhalb der SAP Query ohne weitere Programmanpassungen aufgenommen und entsprechend ausgewertet werden k&ouml;nnen. Ferner sind derartige Erweiterungen keine Modifikationen des SAP-Standards und somit &bdquo;releasebest&auml;ndig&rdquo;, d. h. ein Upgrade beeintr&auml;chtig Ihre Erweiterungen nicht.</P><P class="MsoNormal">Einige PA- als auch PD-Infotypen sind aus technischen Gr&uuml;nden von der M&ouml;glichkeit einer Erweiterung ausgeschlossen. Die folgenden Infotypen sind hier betroffen:</P><P class="MsoNormal">&nbsp;</P><UL><LI><DIV class="MsoNormal">Ma&szlig;nahmen (0000) </DIV><LI><DIV class="MsoNormal">Erg&auml;nzende Ma&szlig;nahmen (0302) </DIV><LI><DIV class="MsoNormal">Alle (!) Infotypen Zeitwirtschaft (2nnn) </DIV><LI><DIV class="MsoNormal">Urlaubsanspruch (0005) </DIV><LI><DIV class="MsoNormal">Mutterschutz/Elternzeit (0080) </DIV><LI><DIV class="MsoNormal">Wehr/Zivildienst (0081) </DIV><LI><DIV class="MsoNormal">Abgeltung Urlaubsanspr&uuml;che (0083) </DIV><LI><DIV class="MsoNormal">Zeitkontingentabgeltungen (0416) </DIV><LI><DIV class="MsoNormal">Objekt (1000)</DIV><LI><DIV class="MsoNormal">Verkn&uuml;pfungen (1001)</DIV><LI><DIV class="MsoNormal">Bewerberma&szlig;nahmen (4000)</DIV></LI></UL><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">Weitere Informationen zur Transaktion <STRONG>PM01</STRONG> sowie dem oben beschriebenen Erweiterungskonzept lassen sich der Online-Dokumentation entnehmen.</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">&nbsp;</P><P class="head1">Technische Details zu Infotypen</P><P class="head1">&nbsp;</P><P class="MsoNormal">Um Infotypen erweitern bzw. eigene Infotypen anlegen zu k&ouml;nnen, sollten Sie zuvor einige technische Details zur Kenntnis genommen haben.</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">&nbsp;</P><P class="head2">Namensr&auml;ume f&uuml;r Infotypen</P><P class="MsoNormal">Infotypen besitzen stets eine eindeutige Nummer (z. B. 0002 = Infotyp <EM>Daten zur Person</EM>). Da Infotypen aus unterschiedlichen Elementen bestehen, bezieht sich dies z. B. auch auf die entsprechende Datenbanktabelle, Infotypstruktur, usw.</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal"><U>Infotypstrukturen (WorkAreas)</U><BR>SAP Standard:</P><P class="MsoNormal">P0000 – P0999 (Personaladministration)&nbsp;<BR>P1000 – P1999 (PD)<BR>P2000 – P2999 (Zeitwirtschaft)<BR>P4000 – P4999 (Personalbeschaffung)</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">Kunde:&nbsp;</P><P class="MsoNormal">P9000 – P9999</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal"><U>Infotypspezifische Felder</U></P><P class="MsoNormal">SAP Standard:</P><P class="MsoNormal">PS0000 – PS0999 (Personaladministration) bzw. HRI1000 – HRI1999 (PD)<BR></P><P class="MsoNormal">Kunde:&nbsp;</P><P class="MsoNormal">PS9000 – PS9999 (PA) bzw. HRI9000 – HRI9999 (PD)</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal"><U>(transparente) Datenbanktabellen</U><BR>SAP Standard:</P><P class="MsoNormal">PA0000 – PA0999 (PA) bzw. HRP1000 – HRP 1999 (PD)<BR>PB0000 – PB0999 + PB4000 – PB4999 (Personalbeschaffung)<BR></P><P class="MsoNormal">Kunde:&nbsp;</P><P class="MsoNormal">PA9000 – PA9999</P><P class="MsoNormal">&nbsp;</P><P class="head2">Pr&uuml;f- und Steuerungstabellen f&uuml;r Infotypen</P><UL><LI><DIV class="MsoNormal">Die Tabelle <STRONG>T777D</STRONG> (Infotypen &#8211; Dialog/Datenbank-Zuordnung) ist die zentrale Pr&uuml;ftabelle f&uuml;r alle Infotypen. Unter anderem werden hier alle infotypabh&auml;ngigen Repository-Objekte (z. B. Tabellen, Strukturen, etc.) abgelegt.</DIV><LI><DIV class="MsoNormal">Tabelle <STRONG>T77ID</STRONG> (Infotypen &#8211; Erg&auml;nzungen zur <STRONG>T777D</STRONG>) stellt eine Erg&auml;nzung zur Tabelle <STRONG>T777D</STRONG> dar.</DIV><LI><DIV class="MsoNormal">Kundenspezifische Einstellungen (wie etwa der Infotypentext) zu PA-Infotypen werden in der Tabelle <STRONG>T582A</STRONG> (Infotypen &#8211; kundenspezifische Einstellungen) vorgenommen.</DIV><LI><DIV class="MsoNormal">Analog hierzu werden kundenspezifische Einstellungen zu PD-Infotypen in der Tabelle <STRONG>T77CD</STRONG> (Infotypen &#8211; Kundenspezifische Einstellungen) hinterlegt.</DIV></LI></UL><P class="MsoNormal"><STRONG>Tipp:</STRONG> Der Report <STRONG>RHT777DCHECK</STRONG> pr&uuml;ft Ihre Tabellen-Einstellungen bzgl. deren Konsistenz.</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">&nbsp;</P><P class="head1">Das Erweiterungs-Szenario</P><P class="MsoNormal"><BR>Die Erweiterung eines Standard Infotypen werden wir im Rahmen dieses Tutorials exemplarisch anhand des Infotypen <EM>Anschriften </EM>(0006) beleuchten. Wir gehen davon aus, dass ein zus&auml;tzliches (Z*-) Datenfeld f&uuml;r die Abbildung des Firmenparkplatzes ben&ouml;tigt wird. Dieses Zusatzfeld soll Auskunft dar&uuml;ber geben k&ouml;nnen, ob der jeweiligen Person ein firmeneigener Parkplatz zur Verf&uuml;gung steht oder nicht. </P><P class="MsoNormal">&nbsp;</P><P class="head2"><BR>1. Erweiterung anlegen</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp2.jpg"><BR>Bild2: Erweiterung anlegen mittels Button &#8220;Alles&#8221;</P></TD></TR></TBODY></TABLE></P><P class="text1">Geben Sie unter Infotypnummer den zu erweitenden Infotypen bzw. dessen Infotypnummer (in unserem Fall 0006) ein und klicken Sie auf den Button <EM>Alles</EM>, um nun alle Teilobjekte zu unserer Erweiterung zu generieren. Im folgenden Dialogfenster best&auml;tigen Sie die Abfrage mit <EM>Anlegen</EM>. Ordnen Sie danach das gew&uuml;nschte <EM>Paket</EM> (fr&uuml;her <EM>Entwicklungsklasse</EM>) zu.<BR></P><P class="MsoNormal">&nbsp;</P><P class="head2">2. Customer-Include zum Infotyp anlegen</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp3.jpg"><BR>Bild3: Zusatzfeld im CI definieren</P></TD></TR></TBODY></TABLE></P><P class="text1">Sie verzweigen in das Data Dictionary (DDIC), wo Sie nun das Customer-Include zum Infotypen 0006 auspr&auml;gen, d. h. die technischen Details zum erforderlichen Zusatzfeld definieren. Vergeben Sie als erstes eine erkl&auml;rende Kurzbeschreibung (z. B. Customer-Include P0006: Zusatzfeld Firmenparkplatzs). Dann vergeben Sie die einen sprechenden Namen f&uuml;r unser Zusatzfeld (in unserem Beispiel <EM>ZZ_CAR_PARK</EM>). Hinterlegen Sie als Komponententyp (CHAR1) um die sp&auml;tere Eingabe eines einstelligen Kennzeichens zu erm&ouml;glichen. Aktivieren Sie die Eingaben mit dem entsprechenden Button oder <STRONG>Strg.+F3</STRONG>. </P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">Kehren Sie mit dem Button <EM>Zur&uuml;ck</EM> auf die urspr&uuml;ngliche Transaktion <STRONG>PM01</STRONG> zur&uuml;ck.</P><P class="MsoNormal">&nbsp;</P><P class="head2"><BR>3. ggf. Modulpool anpassen</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp4.jpg"><BR>Bild4: Plausibilit&auml;tspr&uuml;fungen k&ouml;nnen ggf. im Modulpool ausprogrammiert werden</P></TD></TR></TBODY></TABLE></P><P class="text1">Innerhalb des Bereiches Teilobjekte k&ouml;nnten Sie nun &uuml;ber den Radiobutton Modulpool in das von <STRONG>PM01</STRONG> generierte Coding verzweigen (Programm <EM>ZP000600</EM>). Dort k&ouml;nnten Sie z. B. im PAI-Modul (Include <EM>ZP000630</EM>) Plausibilit&auml;tspr&uuml;fungen zu unserem Zusatzfeld ausprogrammieren, auf was wir in diesem Tutorial nicht weiter eingehen wollen.</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">&nbsp;</P><P class="head2">4. Include-Screen anpassen</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp5.jpg"><BR>Bild5: Anpassung des Infotypdynpros mittels &#8220;Grafischen Layout Editor&#8221;</P></TD></TR></TBODY></TABLE></P><P class="text1">Als n&auml;chsten passen wir das optische Erscheinungsbildung unseres Zusatzfeldes, also das Infotypdynpro, an. Markieren Sie hierzu in der <STRONG>PM01</STRONG> den Radiobutton <EM>Include Screen</EM> und klicken Sie auf <EM>Bearbeiten</EM>. Sie verzweigen daraufhin in den <EM>Screen-Painter</EM> (Transaktion <STRONG>SE51</STRONG>), Achten Sie darauf, dass das Programm <EM>ZP000600</EM> bzw. das Dynpro <EM>0200</EM> hinterlegt sind. Markieren Sie den Radiobutton <EM>Layout Editor</EM> und klicken danach auf &Auml;ndern.</P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal"><STRONG>Tipp:</STRONG> Der sog. grafische Layout Editor erm&ouml;glicht eine komfortable Bearbeitung des Infotypdynpros. Diesen m&uuml;ssen Sie explizit in Ihren Benutzereinstellungen hinterlegen. M&ouml;glich ist dies in der Transaktion <STRONG>SE51</STRONG> &uuml;ber den Men&uuml;pfad <EM>Hilfsmittel&nbsp;<SPAN><SPAN><FONT color="#000000">&agrave;</FONT></SPAN></SPAN> Einstellungen</EM>. Markieren Sie innerhalb der Registerkarte Screen Painter die Checkbox <EM>Grafischer Layout Editor</EM>. </P><P class="MsoNormal">&nbsp;</P><P class="MsoNormal">Ohne weiteres Zutun w&auml;re unser Zusatzfeld nicht besonders sprechend, daher wollen wir als erstes den Namen auf dem Dnypro anpassen. F&uuml;hren Sie hierzu einen Doppelklick auf den Text <EM>Charakter 1</EM> durch und &auml;ndern Sie in dem sich &ouml;ffnenden Fenster den Namen auf <EM>Firmenparkplatz</EM>.</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp6.jpg"><BR>Bild6: Dynpro-Anpassungen zum Zusatzfeld vornehmen<BR></P></TD></TR></TBODY></TABLE></P><P class="MsoNormal">Standardm&auml;&szlig;ig wird unser Zusatzfeld als einstelliges Eingabefeld dargestellt. Sch&ouml;ner w&auml;re eine Checkbox, um dem Endanwender die Eingabe zu erleichtern. &Auml;ndern Sie daher unser Feld entsprechend. Markieren Sie hierzu das komplette Zusatzfeld, d. h. das Eingabefeld sowie den von uns angepassten Text (mittels gedr&uuml;ckter <STRONG>Shift + linker Maus-Taste</STRONG>) und w&auml;hlen Sie den folgenden Men&uuml;pfad: Bearb<EM>eiten&nbsp;<SPAN><SPAN><FONT color="#000000">&agrave;</FONT></SPAN></SPAN> Umwandeln&nbsp;<SPAN><SPAN><FONT color="#000000">&agrave;</FONT></SPAN></SPAN> Ankreuzfeld&nbsp;<SPAN><SPAN><FONT color="#000000">&agrave;</FONT></SPAN></SPAN> Knopf links</EM>. Aktivieren Sie danach unsere Einstellungen &uuml;ber den entsprechenden Button.</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp7.jpg"><BR>Bild7: Umwandlung des Zusatzfeldes zu einem Ankreuzfeld (Checkbox)</P></TD></TR></TBODY></TABLE></P><P class="MsoNormal">&nbsp;</P><P class="head2">5. Erweiterung zuordnen</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp8.jpg"><BR>Bild8: Erweiterung dem Standard Infotypen zuordnen</P></TD></TR></TBODY></TABLE></P><P class="text1">Letzter Schritt: Kehren Sie in die Transaktion <STRONG>PM01</STRONG> zur&uuml;ck und w&auml;hlen Sie den Button <EM>Erweiterung</EM> zuordnen in der Drucktastenzeile. Stellen Sie sicher, dass dem Infotyp 0006 (Modulpool = <EM>MP000600</EM>) mit dem entsprechenden Standarddynpro (z. B. f&uuml;r Deutschland = <EM>2000</EM>) unsere Erweiterung (Programm = <EM>ZP000600</EM>) sowie unser Include-Screen 0200 zugeordnet ist. Nur so wird unser Zusatzfeld auch tats&auml;chlich auf dem Dynpro eingeblendet!</P><P>&nbsp;</P><P class="head1">Das Ergebnis</P><P><TABLE class="tblimg" cellPadding="0" align="left"><TBODY><TR><TD vAlign="top"><P><IMG src="/wp-content/uploads/tt_images/scheffler/Screenshots/Infotyperweiterung/Bild_Infotyp9.jpg"><BR>Bild9: Das fertige Zusatzfeld im Infotypen</P></TD></TR></TBODY></TABLE></P><P class="text1">Fertig! Wenn Sie alle Schritte korrekt abgearbeitet haben, k&ouml;nnen Sie zu einer Person den Infotypen <EM>Anschriften</EM> (0006) anlegen (Transaktion PA30) und unser Zusatzfeld Firmenparkplatz via Checkbox markieren. <BR></P><P class="head1">&nbsp;</P></p>
<p>Der Beitrag <a href="/blog/die-erweiterung-von-pa-infotypen-mittels-pm01/">Die Erweiterung von PA-Infotypen mittels PM01</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
					<wfw:commentRss>/blog/die-erweiterung-von-pa-infotypen-mittels-pm01/feed/</wfw:commentRss>
			<slash:comments>0</slash:comments>
		
		
			</item>
		<item>
		<title>SAP® HR Security &#8211; schützen Sie Ihre sensiblen HR-Daten!</title>
		<link>/blog/sap-hr-security-schuetzen-sie-ihre-sensiblen-hr-daten/</link>
		
		<dc:creator><![CDATA[Enno Wulff]]></dc:creator>
		<pubDate>Thu, 26 May 2005 09:34:19 +0000</pubDate>
				<category><![CDATA[Human Resources]]></category>
		<category><![CDATA[HR]]></category>
		<guid isPermaLink="false">http://wp.tricktresor.com/?p=333</guid>

					<description><![CDATA[<p>Ist Ihre SAP® R/3®-HR Installation von allen Seiten gegen Zugriffe unauthorisierter Personen gesch&#252;tzt? Wenn Sie sich diese Fragen schon einmal gestellt haben, sollten Sie den folgenden Beitrag aufmerksam studieren. Ich habe hier einige pers&#246;nliche Erfahrungswerte aus der Praxis niedergeschrieben, die Ihr HR System nachhaltig vor "fremden Augen" sch&#252;tzen werden...</p>
<p>Der Beitrag <a href="/blog/sap-hr-security-schuetzen-sie-ihre-sensiblen-hr-daten/">SAP® HR Security &#8211; schützen Sie Ihre sensiblen HR-Daten!</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></description>
										<content:encoded><![CDATA[<p>Ist Ihre SAP® R/3®-HR Installation von allen Seiten gegen Zugriffe unauthorisierter Personen gesch&uuml;tzt? Wenn Sie sich diese Fragen schon einmal gestellt haben, sollten Sie den folgenden Beitrag aufmerksam studieren. Ich habe hier einige pers&ouml;nliche Erfahrungswerte aus der Praxis niedergeschrieben, die Ihr HR System nachhaltig vor &#8220;fremden Augen&#8221; sch&uuml;tzen werden&#8230;<br /><P class="head1"><SPAN class="contentHead">Berechtigungskonzept</SPAN></P><P><SPAN class="contentHead"></SPAN>Schotten Sie kritische Spoolauftr&auml;ge (z. B. von Anwendern der Abrechnungsabteilung) vor dem Zugriff durch unauthorisierte Anwender ab! Pflegen Sie hierzu den Benutzerparameter SAU am Benutzerstammsatz der zu sch&uuml;tzenden Anwender z. B. mit dem Wert HR_PY_DRUCK. Das Berechtigungsobjekt S_SPO_ACT muss so ausgepr&auml;gt werden, dass ein Zugriff auf Spoolauftr&auml;ge vom Typ HR_PY_DRUCK nur noch f&uuml;r die entsprechenden Anwender m&ouml;glich ist. </P><P>Sch&uuml;tzen Sie kritische HR Datenbanktabellen (z. B. PA0008, PA0014, PA0015), indem Sie den Zugriff auf diese anhand des Berechtigungsobjektes S_TABU_DIS entsprechend einschr&auml;nken!</P><P>Regeln Sie den Aufruf von kundeneigenen HR Programmen und SAP® Queries durch den Einsatz des Berechtigungsobjekts S_PROGRAM (s. u. &#8211; ABAP Programmierung). Pr&auml;gen Sie dieses so aus, dass z. B. ein Key-User alle Programme und Queries vom Typ HR_KEY und HR_USER ausf&uuml;hren kann, nicht aber die der Kategorie HR_ADMIN. </P><P>Lassen Sie die Transaktionen SE11, SE16, SM30, SM31 (Berechtigungsobjekt S_TCODE) nur bedingt zu! Unauthorisierte Anwender k&ouml;nnten sonst auf Datenbankebene Einsicht in kritische HR-Daten erhalten! </P><P>Nehmen Sie Abstand von der pauschalen Vergabe der ABAP Reporting Transaktion SA38 oder gar SE38, SE80. Wenn Anwender Programme ausf&uuml;hren sollen, so ist es besser, diese in die Bereichmen&uuml;s des Easy Access Men&uuml;s aufzunehmen (ab Release 4.6x) oder entsprechende Berichtsb&auml;ume (bis Release 4.6x) &uuml;ber die Transaktion ORET anzulegen. </P><P>Vorsicht ist bei dem Berechtigungsobjekt P_ABAP angebracht! Falsch ausgepr&auml;gt erm&ouml;glicht dieses Objekt die ungepr&uuml;fte Ausf&uuml;hrung von Programmen im SAP® System. In Verbindung mit z. B. dem Treiber der logischen Datenbank PNP (SAPDBPNP) stehen einem Anwender alle T&uuml;ren im HR weit offen! </P><P>Vergeben Sie nur in dringenden Ausnahmef&auml;llen die Berechtigungsprofile SAP_ALL und SAP_NEW, da diese nahezu alle Berechtigungen im SAP® System beinhalten. </P><P>Erarbeiten Sie ein &#8220;<STRONG>Notfalluserkonzept</STRONG>&#8221; z. B. f&uuml;r den User SAP* (welcher &uuml;ber SAP_ALL und SAP_NEW verf&uuml;gt). Dies ist f&uuml;r den Fall der F&auml;lle notwendig, z. B. wenn Schl&uuml;sselpersonen im Urlaub oder erkrankt sind. Mit einem einfachen Trick l&auml;sst sich an dieser Stelle ein Vier-Augen-Prinzip realisieren: Teilen Sie das Initialkennwort f&uuml;r SAP* auf zwei Personen auf, d. h. den ersten Teil des Kennworts kennt Person A &#8211; den zweiten Teil Person B.</P><P class="head1"><SPAN class="contentHead"><SPAN class="contentHead">R/3®-Benutzer (User)</SPAN></SPAN></P><P><FONT face="Arial" size="1"><SPAN class="contentHead"></SPAN></FONT>Von Seiten der SAP® werden mit einem R/3® System standardm&auml;&szlig;ig die User SAP* and DDIC ausgeliefert. Diese sind mit Initialkennw&ouml;rtern versehen, die einer breiten &Ouml;ffentlichkeit bekannt sind. Mit dem Programm RSUSR003 k&ouml;nnen Sie pr&uuml;fen, ob diese User in Ihrem System noch immer mit den Defaultkennw&ouml;rtern versehen sind oder nicht. Achten Sie hierbei insbesondere auf den SAP Auslieferungsmandanten 000 und auf den EarlyWatch Mandanten 066!</P><P>Mit Hilfe der sog. Ausnahmetabelle (USR40) ist es m&ouml;glich, Kennw&ouml;rter f&uuml;r R/3-Benutzer systemseitig nicht zu gestatten. Dies bietet sich z. B. f&uuml;r Firmennamen oder gel&auml;ufigen Kennw&ouml;rtern wie etwa asdf, jkl&ouml;, 1234, usw. an. </P><P>Verhindern Sie &#8220;Karteileichen&#8221; unter den Usern Ihres R/3® Systems, indem Sie regelm&auml;&szlig;ig pr&uuml;fen, welche sich seit l&auml;ngerer Zeit nicht mehr angemeldet haben (Mitarbeiter inzwischen ausgetreten?). M&ouml;glich ist dies mit dem Programm RSUSR006.&nbsp;</P><P class="head1"><SPAN class="contentHead">ABAP® Programmierung</SPAN></P><P><SPAN class="contentHead"></SPAN>Pflegen Sie bei kundeneigenen Z*/Y*-Programmen stets die Berechtigungsgruppe (unter Programmeigenschaften bzw. Attribute). Zur Zuordnung von Programmen zu Berechtigungsgruppen kann auch der Report RSCSAUTH (Pflege/Restore Berechtigungsgruppen) benutzt werden, der ausf&uuml;hrlich dokumentiert ist. Auch bei und SAP® Queries ist dies sehr sinnvoll! Unterteilen Sie hierbei in verschiedenen Kategorieren z. B. in HR_USER (unkritisch), HR_KEY (nur f&uuml;r Key-User) und HR_ADMIN (nur f&uuml;r Systemadministratoren, Modulbetreuer). Sch&uuml;tzen Sie diese Programme unter Einsatz von dem Berechtigungsobjekt S_PROGRAM (s. o. &#8211; Berechtigungskonzept).</P><P>Aktivieren Sie die Tabellenprotokollierung bei kundeneigenen Z*/Y*-Tabellen. Dies k&ouml;nnen Sie innerhalb des DDIC (Transaktion SE11) &uuml;ber die Technischen Einstellungen zur jeweiligen Tabelle durchf&uuml;hren. Ferner muss der Profilparameter Rec/Client (siehe unten) entsprechend gesetz werden.</P><P>Oftmals stellt das Entwicklungs- oder Konsolidierungssystem eine Schwachstelle im HR-Sicherheitskonzept dar. Das Problem: Zur Programmierung im HR-Umfeld ist ein gewisser Grundstock an zeitnahen personalwirtschaftlichen Daten unerl&auml;sslich. Oft werden diese etwa durch eine Systemkopie des Produktivsystems zur Verf&uuml;gung gestellt. Dies ist &auml;u&szlig;erst kritisch, insbesondere deshalb, weil auf genannten Systemen oftmals freiz&uuml;giger mit Berechtigungen hantiert wird. Einige Anbieter besitzen Tools in ihrem Sortiment, die das Problem l&ouml;sen, indem sie system&uuml;bergreifend Personalstammdaten kopieren und diese hierbei anonymisieren (z. B.&nbsp;<A href="http://www.gasparin.at/german/zptstdatf.html" Target="_blank">http://www.gasparin.at/german/zptstdatf.html</A> oder <A class="r" href="http://www.pecaso.de/home.php" target="_blank" Target="_blank"><SPAN class="style2">http://www.pecaso.de/home.php</SPAN></A>) k&ouml;nnen! Vergessen Sie aber nicht zuvor alle Stammdaten inkl. der Clusterdaten zu l&ouml;schen (z. B. mit dem Standardprogramm RPUDELPN).</P><P>Verpflichten Sie alle ABAP® Programmierer im HR Umfeld dazu, Authority-Checks in kundeneigenen Z*/Y*-Programmen zu implementieren. Andernfalls k&ouml;nnte auf diesem Wege das beste Berechtigungskonzept ausgehebelt werden, wenn DB-Tabellen direkt gelesen werden! Bei Programmen die auf einer logischen Datenbank (z. B. PNP, PNPCE) beruhen ist dies nicht notwendig, da bereits dort alle notwendigen Berechtigungspr&uuml;fungen durchgef&uuml;hrt werden. </P><P class="head1"><SPAN class="contentHead">Systemeinstellungen</SPAN></P><P><SPAN class="contentHead"></SPAN>Um die Sicherheit Ihrer SAP® R/3®-HR Installation zu verbessern, sollten Sie die folgenden Profilparameter einer Pr&uuml;fung unterziehen (m&ouml;glich ist das mit dem Programm RSPARAM) und diese ggf. &auml;ndern. Bitte betrachten Sie die angegebenen Werte als Vorschlagswerte.<BR></P><UL><LI>Rdisp/gui_auto_logout = 1800<BR>Auto-Logout-Funktion. Ein Anwender der nicht aktiv im R/3® arbeitet wird nach 30 Minuten automatisch abgemeldet. <LI>Login/fails_to_session_end = 3<BR>Bei dreimaliger Falschanmeldung am R/3-System wird die Verbindung automatisch beendet. <LI>Login/fails_to_users_lock = 5<BR>Nach f&uuml;nf falschen Kennworteingaben wird der R/3®-Benutzer (User) gesperrt. Erst durch eine Entsperrung durch den Systemadministrator ist eine erneute Anmeldung wieder m&ouml;glich. <LI>Login/min_password_lng = 6<BR>Das Kennwort des Anwenders muss mindestens sechsstellig sein. <LI>Login/password_expiration_time = 90<BR>Das Kennwort des Anwenders &#8220;verf&auml;llt&#8221; nach drei Monaten. Er wird aufgefordert, ein neues Kennwort zu vergeben. <LI>Rec/client = ON<BR>Dieser &auml;u&szlig;erst wichtige Schalter steuert die Tabellenprotokollierung je Mandant (vergessen Sie nicht den SAP© Auslieferungs-Mandanten 000). Aufgrund der in Deutschland gesetzlich vorgeschriebenen Nachvollziehbarkeit von Programm&auml;nderungen (Tabelleninhalte sind als ausgelagertes Programmcoding zu verstehen) muss dieser Profilparameter stets aktiviert sein!</LI></UL><P class="head1"><SPAN class="contentHead">Sonstiges</SPAN></P><P><SPAN class="contentHead"></SPAN><SPAN class="contentHead"></SPAN>Das Programm RPUAUD00 erm&ouml;glicht eine Protokollierung der &Auml;nderungen von Infotypen. Somit ist es m&ouml;glich zu rekonstruiert, welcher Sachverhalt von welchem Anwender zu welchem Zeitpunkt gepflegt wurde. Dies ist insbesondere f&uuml;r kritische Informationstypen wie etwa dem Infotypen Basisbez&uuml;ge (0008) sinnvoll! Alte &Auml;nderungsprotokolle lassen sich hierbei mit dem Programm RPUAUD00 wieder l&ouml;schen. Beachten Sie das f&uuml;r die Protokollierung notwendige Customizing: Damit Ver&auml;nderungen von Infotypfeldern (&Auml;ndern, Anlegen, L&ouml;schen) als Belege erfa&szlig;t werden, m&uuml;ssen die entsprechenden Felder in den Views Belegrelevante Infotypen (V_T585A), Feldgruppendefinition (V_T585B) und Feldgruppeneigenschaften (V_T585C) gepflegt werden. </P><P>Der Report RPUPROTD liefert Ihnen eine genaue Auflistung der Programmstarts kritischer Auswertungen. Beachten Sie das notwendige Customizing: Protokolle zu den Reportsstarts werden nur dann erzeugt, wenn der auszuf&uuml;hrende Report in der Tabelle HR Reportattribute (V_T599R) vorhanden und die Markierung Protokollierung beim Start im Online erw&uuml;nscht gesetzt ist. </P><P>Sofern Sie ESS (Employee Self Service) Szenarien (z. B. Entgeltnachweis &uuml;ber Internet/Intranet) einsetzen, sch&uuml;tzen Sie dringend den Infotypen Kommunikation (0105 Subtyp 0001) vor unbefugter Manipulation! Andernfalls k&ouml;nnte sich ein Anwender an dieser Stelle einen fremden R/3®-Benutzer (User) als den seinen zuordnen und w&uuml;rde &uuml;ber den &#8220;Umweg&#8221; ESS dann Zugriff auf diese Personalnummer erhalten. </P><P>Verpflichten Sie alle HR-Endanwender dazu, Bildschirmschoner mit Kennwortschutz einzusetzen. Was nutzt ein perfektes Berechtigungskonzept, wenn ein Anwender mit ge&ouml;ffneten SAP Modus das Zimmer verl&auml;sst und unauthorisierte Personen so Einblick erhalten?</P><P><FONT color="#f49047">powered by SchefflerConsulting &#8211; Human Capital Management mit mySAP HR©</FONT></P></p>
<p>Der Beitrag <a href="/blog/sap-hr-security-schuetzen-sie-ihre-sensiblen-hr-daten/">SAP® HR Security &#8211; schützen Sie Ihre sensiblen HR-Daten!</a> erschien zuerst auf <a href="/">Tricktresor</a>.</p>
]]></content:encoded>
					
		
		
			</item>
	</channel>
</rss>
